In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("/Users/pavan/jupyter/deep_learning/homeprices_banglore.csv")

In [3]:
df.head()

   area  bedrooms   price
0  1056         2   39.07
1  2600         4  120.00
2  1440         3   62.00
3  1521         3   75.00
4  1200         2   51.00

In [4]:
df.shape

(20, 3)

In [5]:
df.describe()

              area   bedrooms       price
count    20.000000  20.000000   20.000000
mean   1821.450000   2.900000   78.853500
std     864.615794   0.967906   43.761901
min     800.000000   1.000000   32.000000
25%    1173.750000   2.000000   41.500000
50%    1480.500000   3.000000   61.000000
75%    2633.000000   3.250000  106.500000
max    3700.000000   5.000000  167.000000

In [6]:
df.tail()

    area  bedrooms  price
15  1175         2   42.0
16  1180         3   48.0
17  1540         3   60.0
18  2770         3  102.0
19   800         1   32.0

In [7]:
df[1:5]

   area  bedrooms  price
1  2600         4  120.0
2  1440         3   62.0
3  1521         3   75.0
4  1200         2   51.0

In [8]:
df.columns

Index(['area', 'bedrooms', 'price'], dtype='object')

In [9]:
df['bedrooms'].max()

5

In [10]:
df.bedrooms.max()

5

In [11]:
df.bedrooms.min()

1

In [12]:
df[['bedrooms', 'price']].head()

   bedrooms   price
0         2   39.07
1         4  120.00
2         3   62.00
3         3   75.00
4         2   51.00

In [13]:
df[['bedrooms', 'price']][df['bedrooms'] >= 4]

    bedrooms  price
1          4  120.0
6          4  135.0
7          4  155.0
9          5  167.0
11         4  140.0

In [14]:
df[df['price'] >= 120]

    area  bedrooms  price
1   2600         4  120.0
6   2732         4  135.0
7   3300         4  155.0
9   3700         5  167.0
11  2785         4  140.0

In [15]:
df.set_index('area', inplace = True)

In [16]:
df.head()

      bedrooms   price
area
1056         2   39.07
2600         4  120.00
1440         3   62.00
1521         3   75.00
1200         2   51.00

In [17]:
df.loc[1056:1200]

      bedrooms   price
area
1056         2   39.07
2600         4  120.00
1440         3   62.00
1521         3   75.00
1200         2   51.00

In [19]:
df.reset_index(inplace=True)
df.head()

   area  bedrooms   price
0  1056         2   39.07
1  2600         4  120.00
2  1440         3   62.00
3  1521         3   75.00
4  1200         2   51.00

In [27]:
df.loc[0:5]

   area  bedrooms   price
0  1056         2   39.07
1  2600         4  120.00
2  1440         3   62.00
3  1521         3   75.00
4  1200         2   51.00
5  1170         2   38.00

In [34]:
df.iloc[0:2,1:].sum()

bedrooms      6.00
price       159.07
dtype: float64

In [35]:
df.loc[0:2].sum()

area        5096.00
bedrooms       9.00
price        221.07
dtype: float64